function Challengedata(){

  this.challengetext = [
    "昇段リセットは1e24ポイントから可能になります。",
    "発生器は高速に値上がりします。",
    "発生器購入数による強化は無効になります。",
    "発生器のモードは0に固定されます。",
    "段位によらない基礎的な下位モード強化は無効となります。",
    "時間加速器は購入できません。",
    "発生器4以降は購入できません。",
    "段位リセット回数による強化は無効になります。",
  ],
  this.rewardtext = [
    "昇段リセット後1e4ポイント獲得",
    "昇段リセット後10個の時間加速器1獲得",
    "番号が最高の発生器にも購入数ボーナスが働く",
    "全発生器の生産力が2倍に",
    "効力の選び直しが可能に（工事中）",
    "発生器自動購入器を入手（工事中）",
    "時間加速器1に購入数ボーナスが働く（工事中）",
    "発生器1の生産力が一度に取得した最大段位数倍に（工事中）",
    "段位リセットの増加分が2倍に（工事中）",
    "時間加速器自動購入器を入手（工事中）",
    "時間加速器1に購入数ボーナスが働く（工事中）",
    "発生器の購入数ボーナスが強化（工事中）",
    "リセット時の段位取得数が2倍に（工事中）",
    "発生器は同時に全てのモードとなる（工事中）",
    "自動段位リセット器を入手（工事中）",

  ],
  this.rewardcost = [
    1,
    2,
    4,
    8,
    8,
    8,
    16,
    16,
    16,
    16,
    32,
    32,
    32,
    32,
    32
  ]



}
