function Timedata(){

	this.campaigns = [

		"新年キャンペーン",
		"バレンタインキャンペーン",
		"ひなまつりキャンペーン",
		"ゴールデンウィークキャンペーン",
		"周年キャンペーン",
		"シルバーウィークキャンペーン",
		"クリスマスキャンペーン",
		"新年キャンペーン2025",
		"ゴールデンウィークキャンペーン2",
		"クリスマスキャンペーン2",

	]

	this.campaignnames = [

		"newyear",
		"vt",
		"hina",
		"gw",
		"aniv",
		"sw",
		"xmas",
		"newyear2025",
		"gw2",
		"xmas2"

	]

	this.campaigneffects = [

		"発生器の倍率が+4倍",
		"発生器の倍率が+4倍",
		"発生器の倍率が+4倍",
		"発生器の倍率が+4倍",
		"発生器の倍率が+8倍",
		"発生器の倍率が+4倍",
		"発生器の倍率が+4倍",
		"挑戦4と5を含む挑戦中、発生器の倍率が+40倍",
		"金片の入手数が+4個",
		"輝き系の入手時、50%確率で入手数+1"

	]

	this.campaigncosts = [
		1,
		1,
		1,
		1,
		2,
		1,
		1,
		3,
		2,
		2
	]



}